PART3_DERIVATION_TREE_PRETTY.md
```mermaid
graph TD
  n0["PROGRAM"]
  n1["STATEMENT"]
  n2["STATEMENT"]
  n3["IF"]
  n4["ELSE"]
  n5["BLOCK"]
  n6["STATEMENT"]
  n7["PRINT"]
  n8["NUM\n[2]"]
  n9["BLOCK"]
  n10["STATEMENT"]
  n11["PRINT"]
  n12["NUM\n[1]"]
  n13["BINOP"]
  n14["NUM\n[5]"]
  n15["OP\n[>]"]
  n16["ID\n[a]"]
  n17["DECLARATION"]
  n18["NUM\n[10]"]
  n19["ID\n[a]"]
  n20["TYPE\n[num]"]
  n0 --> n1
  n0 --> n2
  n2 --> n3
  n3 --> n4
  n4 --> n5
  n5 --> n6
  n6 --> n7
  n7 --> n8
  n3 --> n9
  n9 --> n10
  n10 --> n11
  n11 --> n12
  n3 --> n13
  n13 --> n14
  n13 --> n15
  n13 --> n16
  n2 --> n17
  n17 --> n18
  n17 --> n19
  n17 --> n20
```
