PART3_DERIVATION_TREE_PRETTY.md
```mermaid
graph TD
  n0["PROGRAM"]
  n1["STATEMENT"]
  n2["STATEMENT"]
  n3["STATEMENT"]
  n4["PRINT"]
  n5["ID\n[x]"]
  n6["ID\n[y]"]
  n7["DECLARATION"]
  n8["BINOP"]
  n9["NUM\n[4]"]
  n10["OP\n[*]"]
  n11["BINOP"]
  n12["NUM\n[3]"]
  n13["OP\n[+]"]
  n14["NUM\n[2]"]
  n15["ID\n[y]"]
  n16["TYPE\n[num]"]
  n17["DECLARATION"]
  n18["BINOP"]
  n19["BINOP"]
  n20["NUM\n[4]"]
  n21["OP\n[*]"]
  n22["NUM\n[3]"]
  n23["OP\n[+]"]
  n24["NUM\n[2]"]
  n25["ID\n[x]"]
  n26["TYPE\n[num]"]
  n0 --> n1
  n0 --> n2
  n0 --> n3
  n3 --> n4
  n4 --> n5
  n4 --> n6
  n3 --> n7
  n7 --> n8
  n8 --> n9
  n8 --> n10
  n8 --> n11
  n11 --> n12
  n11 --> n13
  n11 --> n14
  n7 --> n15
  n7 --> n16
  n3 --> n17
  n17 --> n18
  n18 --> n19
  n19 --> n20
  n19 --> n21
  n19 --> n22
  n18 --> n23
  n18 --> n24
  n17 --> n25
  n17 --> n26
```
