part3_graphs/testcases_valid_test4_arithmetic.bro.dot
digraph DerivationTree {
  rankdir=TB;
  node [shape=box, style=rounded, fontname="Helvetica"];
  n0 [label="PROGRAM"];
  n1 [label="STATEMENT"];
  n2 [label="STATEMENT"];
  n3 [label="STATEMENT"];
  n4 [label="PRINT"];
  n5 [label="ID\n[x]"];
  n6 [label="ID\n[y]"];
  n7 [label="DECLARATION"];
  n8 [label="BINOP"];
  n9 [label="NUM\n[4]"];
  n10 [label="OP\n[*]"];
  n11 [label="BINOP"];
  n12 [label="NUM\n[3]"];
  n13 [label="OP\n[+]"];
  n14 [label="NUM\n[2]"];
  n15 [label="ID\n[y]"];
  n16 [label="TYPE\n[num]"];
  n17 [label="DECLARATION"];
  n18 [label="BINOP"];
  n19 [label="BINOP"];
  n20 [label="NUM\n[4]"];
  n21 [label="OP\n[*]"];
  n22 [label="NUM\n[3]"];
  n23 [label="OP\n[+]"];
  n24 [label="NUM\n[2]"];
  n25 [label="ID\n[x]"];
  n26 [label="TYPE\n[num]"];
  n0 -> n1;
  n0 -> n2;
  n0 -> n3;
  n3 -> n4;
  n4 -> n5;
  n4 -> n6;
  n3 -> n7;
  n7 -> n8;
  n8 -> n9;
  n8 -> n10;
  n8 -> n11;
  n11 -> n12;
  n11 -> n13;
  n11 -> n14;
  n7 -> n15;
  n7 -> n16;
  n3 -> n17;
  n17 -> n18;
  n18 -> n19;
  n19 -> n20;
  n19 -> n21;
  n19 -> n22;
  n18 -> n23;
  n18 -> n24;
  n17 -> n25;
  n17 -> n26;
}
