PART3_DERIVATION_TREE_PRETTY.md
```mermaid
graph TD
  n0["PROGRAM"]
  n1["STATEMENT"]
  n2["STATEMENT"]
  n3["IF"]
  n4["BLOCK"]
  n5["STATEMENT"]
  n6["IF"]
  n7["ELSE"]
  n8["BLOCK"]
  n9["STATEMENT"]
  n10["PRINT"]
  n11["NUM\n[2]"]
  n12["BLOCK"]
  n13["STATEMENT"]
  n14["PRINT"]
  n15["NUM\n[1]"]
  n16["BOOL\n[sahi]"]
  n17["ID\n[flag]"]
  n18["DECLARATION"]
  n19["BOOL\n[sahi]"]
  n20["ID\n[flag]"]
  n21["TYPE\n[bool]"]
  n0 --> n1
  n0 --> n2
  n2 --> n3
  n3 --> n4
  n4 --> n5
  n5 --> n6
  n6 --> n7
  n7 --> n8
  n8 --> n9
  n9 --> n10
  n10 --> n11
  n6 --> n12
  n12 --> n13
  n13 --> n14
  n14 --> n15
  n6 --> n16
  n3 --> n17
  n2 --> n18
  n18 --> n19
  n18 --> n20
  n18 --> n21
```
