part3_graphs/testcases_valid_test5_nested_if.bro.dot
digraph DerivationTree {
  rankdir=TB;
  node [shape=box, style=rounded, fontname="Helvetica"];
  n0 [label="PROGRAM"];
  n1 [label="STATEMENT"];
  n2 [label="STATEMENT"];
  n3 [label="IF"];
  n4 [label="BLOCK"];
  n5 [label="STATEMENT"];
  n6 [label="IF"];
  n7 [label="ELSE"];
  n8 [label="BLOCK"];
  n9 [label="STATEMENT"];
  n10 [label="PRINT"];
  n11 [label="NUM\n[2]"];
  n12 [label="BLOCK"];
  n13 [label="STATEMENT"];
  n14 [label="PRINT"];
  n15 [label="NUM\n[1]"];
  n16 [label="BOOL\n[sahi]"];
  n17 [label="ID\n[flag]"];
  n18 [label="DECLARATION"];
  n19 [label="BOOL\n[sahi]"];
  n20 [label="ID\n[flag]"];
  n21 [label="TYPE\n[bool]"];
  n0 -> n1;
  n0 -> n2;
  n2 -> n3;
  n3 -> n4;
  n4 -> n5;
  n5 -> n6;
  n6 -> n7;
  n7 -> n8;
  n8 -> n9;
  n9 -> n10;
  n10 -> n11;
  n6 -> n12;
  n12 -> n13;
  n13 -> n14;
  n14 -> n15;
  n6 -> n16;
  n3 -> n17;
  n2 -> n18;
  n18 -> n19;
  n18 -> n20;
  n18 -> n21;
}
