PART3_DERIVATION_TREE_PRETTY.md
```mermaid
graph TD
  n0["PROGRAM"]
  n1["STATEMENT"]
  n2["STATEMENT"]
  n3["STATEMENT"]
  n4["PRINT"]
  n5["ID\n[PI]"]
  n6["ID\n[MSG]"]
  n7["CONSTANT_DECL"]
  n8["STR\n['hello']"]
  n9["ID\n[MSG]"]
  n10["TYPE\n[str]"]
  n11["CONSTANT_DECL"]
  n12["NUM\n[3]"]
  n13["ID\n[PI]"]
  n14["TYPE\n[num]"]
  n0 --> n1
  n0 --> n2
  n0 --> n3
  n3 --> n4
  n4 --> n5
  n4 --> n6
  n3 --> n7
  n7 --> n8
  n7 --> n9
  n7 --> n10
  n3 --> n11
  n11 --> n12
  n11 --> n13
  n11 --> n14
```
